In [2]:
print("Inteligência artificial")

Inteligência artificial

In [ ]:
pip install pandas

In [6]:
import pandas as pd

In [12]:
#cria o dicionário

dicionario = {
    "A": [1, 2, 3, 4],
    "B": [5, 6, 7, 8],
    "C": [9, 10, 11, 12]
}

labels = ["1ª linha", "2ª linha", "3ª linha", "4ª linha"]

In [13]:
dados = pd.DataFrame(dicionario, index = labels)

In [17]:
dados.head() #exibe as 4 primeiras linhas da base de dados

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10
3ª linha  3  7  11
4ª linha  4  8  12

In [18]:
dados.head(2)

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10

In [19]:
dados.tail() #exibe as últimas 4 linhas do dataframe

          A  B   C
1ª linha  1  5   9
2ª linha  2  6  10
3ª linha  3  7  11
4ª linha  4  8  12

In [ ]:
dados.describe() #informa as estatísticas dos dados

In [21]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1ª linha to 4ª linha
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [22]:
print(dados.describe())
print(dados.info())

              A         B          C
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1ª linha to 4ª linha
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes
None

In [23]:
dados['D'] = dados['B'] * dados['C'] #multiplicação de colunas dataframe

In [24]:
dados.head()

          A  B   C   D
1ª linha  1  5   9  45
2ª linha  2  6  10  60
3ª linha  3  7  11  77
4ª linha  4  8  12  96

In [26]:
dados.drop('B', axis=1, inplace=True) #exclui a coluna B
#O implace permite a exclusão de uma coluna na base de dados original

In [27]:
dados.head()

          A   C   D
1ª linha  1   9  45
2ª linha  2  10  60
3ª linha  3  11  77
4ª linha  4  12  96

In [28]:
dados.loc["3ª linha"]

A     3
C    11
D    77
Name: 3ª linha, dtype: int64

In [ ]:
dados.loc[["3ª linha", "2ª linha"], ["A", "C"]] #busca mais de uma linha e coluna no DF

In [33]:
dados.iloc[0:2, 0:2] #iloc é para exibir linhas a partir do índice posição

          A   C
1ª linha  1   9
2ª linha  2  10

In [36]:
filtro = dados['A']>0 #armazena o resultado na variável 'filtro'

In [37]:
filtro

1ª linha    True
2ª linha    True
3ª linha    True
4ª linha    True
Name: A, dtype: bool

In [38]:
dados['filtro'] = filtro #armazena o filtro nessa base de dados

In [42]:
dados[(dados['A']>=2) & (dados['C']>=2)] #filtro na coluna A e C

          A   C   D  filtro
2ª linha  2  10  60    True
3ª linha  3  11  77    True
4ª linha  4  12  96    True

In [43]:
dados.reset_index()

      index  A   C   D  filtro
0  1ª linha  1   9  45    True
1  2ª linha  2  10  60    True
2  3ª linha  3  11  77    True
3  4ª linha  4  12  96    True

In [44]:
dados.set_index('C') #altera o index do dataframe

    A   D  filtro
C
9   1  45    True
10  2  60    True
11  3  77    True
12  4  96    True

In [59]:
dicionario_1 = {
    'A': [10, 20, 30, 40],
    'B': [50, 60, 70, 80],
    'C': [90, 100, 110, 120],
    'Chaves': ['AA', 'BB', 'CC', 'DD']
}

dicionario_2 = {
    'A': [5, 10, 15, 20],
    'B': [35, 70, 105, 140],
    'C': [100, 200, 300, 400],
    'Chaves': ['AA', 'BB', 'CC', 'DD']
}

dicionario_3 = {
    'A': [-10, -20, -30, -40],
    'B': [25, 50, 75, 100],
    'C': [90, 100, 110, 120],
    'Chaves': ['AA', 'BB', 'CC', 'DD']
}

labels_1 = ['1ª linha', '2ª linha', '3ª linha', '4ª linha']
labels_2 = ['5ª linha', '6ª linha', '7ª linha', '8ª linha']
labels_3 = ['9ª linha', '10ª linha', '11ª linha', '12ª linha']

In [60]:
df1 = pd.DataFrame(dicionario_1, index=labels_1)
df2 = pd.DataFrame(dicionario_2, index=labels_2)
df3 = pd.DataFrame(dicionario_3, index=labels_3)

In [61]:
dados_df = pd.concat([df1, df2, df3]) #junta os dataframes desde que tenham a mesma estrutura

In [62]:
dados_df.head(10) #exibe o dataframe unificado

            A    B    C Chaves
1ª linha   10   50   90     AA
2ª linha   20   60  100     BB
3ª linha   30   70  110     CC
4ª linha   40   80  120     DD
5ª linha    5   35  100     AA
6ª linha   10   70  200     BB
7ª linha   15  105  300     CC
8ª linha   20  140  400     DD
9ª linha  -10   25   90     AA
10ª linha -20   50  100     BB

In [63]:
df_n = pd.merge(df1, df2, how='inner', on='Chaves') #une o dataframe a partir da semelhaça das chaves nas colunas

In [64]:
df_n.head()

   A_x  B_x  C_x Chaves  A_y  B_y  C_y
0   10   50   90     AA    5   35  100
1   20   60  100     BB   10   70  200
2   30   70  110     CC   15  105  300
3   40   80  120     DD   20  140  400

In [69]:
dicionario_1 = {
    'A': [10, 20, 30, 40],
    'B': [50, 60, 70, 80],
    'C': [90, 100, 110, 120],
}

dicionario_3 = {
    'D': [30, 20, 50, 40],
    'E': [1, 2, 3, 4],
    'F': [7, 8, 9, 10],
}

labels_n = ['1ª linha', '2ª linha', '3ª linha', '4ª linha']

In [70]:
dataframe1 = pd.DataFrame(dicionario_1, index = labels_1)
dataframe3 = pd.DataFrame(dicionario_3, index = labels_1)

In [73]:
dataframe1.join(dataframe3) #unifica os dataframes com base na label

           A   B    C   D  E   F
1ª linha  10  50   90  30  1   7
2ª linha  20  60  100  20  2   8
3ª linha  30  70  110  50  3   9
4ª linha  40  80  120  40  4  10